Repository: dino/dino
Catalog: plugins/omemo/po/*.po
Languages: th

source: %s has been using an untrusted device. You won't see messages from devices that you do not trust.
th: %s ได้ใช้อุปกรณ์ที่ไม่น่าเชื่อถือ คุณจะไม่เห็นข้อความจากอุปกรณ์ที่คุณไม่น่าเชื่อถือ

source: Manage devices
th: จัดการอุปกรณ์

source: %s does not trust this device. That means, you might be missing messages.
th: %s ไม่เชื่อถืออุปกรณ์นี้ นั่นหมายความว่าคุณอาจพลาดข้อความ

source: Manage Key
th: จัดการกุญแจ

source: Compare the fingerprint, character by character, with the one shown on your contact's device.
th: เปรียบเทียบลายนิ้วมือแต่ละอักขระกับลายนิ้วมือที่แสดงบนอุปกรณ์ของผู้ติดต่อของคุณ

source: Fingerprints differ
th: ลายนิ้วมือแตกต่างกัน

source: Fingerprints match
th: ลายนิ้วมือตรงกัน

source: Cancel
th: ยกเลิก

source: Confirm
th: ยืนยัน

source: Verify key
th: ตรวจสอบคีย์

source: Future messages sent by %s from the device that uses this key will be highlighted accordingly in the chat window.
th: ข้อความในอนาคตที่ส่งโดย %s จากอุปกรณ์ที่ใช้คีย์นี้จะถูกไฮไลท์ในหน้าต่างแชทตามลำดับ

source: Fingerprints do not match
th: ลายนิ้วมือไม่ตรงกัน

source: Please verify that you are comparing the correct fingerprint. If fingerprints do not match, %s's account may be compromised and you should consider rejecting this key.
th: โปรดตรวจสอบให้แน่ใจว่าคุณกำลังเปรียบเทียบลายนิ้วมือที่ถูกต้อง หากลายนิ้วมือไม่ตรงกัน บัญชีของ %s อาจถูกบุกรุก และคุณควรพิจารณาปฏิเสธคีย์นี้

source: Verify key fingerprint
th: ตรวจสอบลายนิ้วมือคีย์

source: Compare this key's fingerprint with the fingerprint displayed on the contact's device.
th: เปรียบเทียบลายนิ้วมือของคีย์นี้กับลายนิ้วมือที่แสดงบนอุปกรณ์ของผู้ติดต่อ

source: Reject key
th: ปฏิเสธคีย์

source: Block encrypted communication with the contact's device that uses this key.
th: บล็อกการสื่อสารที่เข้ารหัสกับอุปกรณ์ของผู้ติดต่อที่ใช้คีย์นี้

source: Accept key
th: ยอมรับคีย์

source: Allow encrypted communication with the contact's device that uses this key.
th: อนุญาตให้มีการสื่อสารแบบเข้ารหัสกับอุปกรณ์ของผู้ติดต่อที่ใช้คีย์นี้

source: This key is currently %s.
th: คีย์นี้ปัจจุบันคือ %s

source: accepted
th: ได้รับการยอมรับ

source: This means it can be used by %s to receive and send encrypted messages.
th: ซึ่งหมายความว่าสามารถใช้โดย %s เพื่อรับและส่งข้อความเข้ารหัสได้

source: verified
th: ตรวจสอบแล้ว

source: Additionally it has been verified to match the key on the contact's device.
th: นอกจากนี้ ยังได้รับการตรวจสอบว่าตรงกับคีย์บนอุปกรณ์ของผู้ติดต่อแล้ว

source: rejected
th: ถูกปฏิเสธ

source: This means it cannot be used by %s to decipher your messages, and you won't see messages encrypted with it.
th: ซึ่งหมายความว่าไม่สามารถใช้ %s เพื่อถอดรหัสข้อความของคุณได้ และคุณจะไม่เห็นข้อความที่เข้ารหัสด้วยมัน

source: You won't see encrypted messages from the device of %s that uses this key. Conversely, that device won't be able to decipher your messages anymore.
th: คุณจะไม่เห็นข้อความเข้ารหัสจากอุปกรณ์ของ %s ที่ใช้คีย์นี้ ในทางกลับกัน อุปกรณ์นั้นจะไม่สามารถถอดรหัสข้อความของคุณได้อีกต่อไป

source: You will be able to exchange encrypted messages with the device of %s that uses this key.
th: คุณจะสามารถแลกเปลี่ยนข้อความเข้ารหัสกับอุปกรณ์ %s ที่ใช้คีย์นี้ได้

source: Back
th: กลับ

source: Manage
th: จัดการ

source: This contact has new devices
th: ผู้ติดต่อรายนี้มีอุปกรณ์ใหม่

source: OMEMO trust decision required
th: จำเป็นต้องมีการตัดสินใจเกี่ยวกับความไว้วางใจของ OMEMO

source: Did you add a new device for account %s?
th: คุณได้เพิ่มอุปกรณ์ใหม่สำหรับบัญชี %s แล้วหรือยัง?

source: OMEMO by default
th: OMEMO ตามค่าเริ่มต้น

source: Enable OMEMO encryption for new conversations
th: เปิดใช้งานการเข้ารหัส OMEMO สำหรับการสนทนาใหม่

source: Encrypt to new devices
th: เข้ารหัสไปยังอุปกรณ์ใหม่

source: Automatically encrypt to new devices from this contact.
th: เข้ารหัสไปยังอุปกรณ์ใหม่จากผู้ติดต่อนี้โดยอัตโนมัติ

source: New keys
th: กุญแจใหม่

source: New encryption keys from your other devices will be accepted automatically.
th: คีย์การเข้ารหัสใหม่จากอุปกรณ์อื่นของคุณจะได้รับการยอมรับโดยอัตโนมัติ

source: This device
th: อุปกรณ์นี้

source: Other device
th: อุปกรณ์อื่น ๆ

source: Device
th: อุปกรณ์

source: Accepted
th: ได้รับการยอมรับ

source: Rejected
th: ถูกปฏิเสธ

source: Verified
th: ได้รับการยืนยันแล้ว

source: New device
th: อุปกรณ์ใหม่

source: Each device has its own OMEMO key. Messages can only be decrypted by a device if they are encrypted to its key. Messages are only encrypted to accepted devices.
th: แต่ละอุปกรณ์จะมีคีย์ OMEMO ของตัวเอง ข้อความสามารถถอดรหัสได้โดยอุปกรณ์เฉพาะเมื่อเข้ารหัสด้วยคีย์ของอุปกรณ์นั้นๆ เท่านั้น ข้อความจะถูกเข้ารหัสไปยังอุปกรณ์ที่ได้รับการยอมรับเท่านั้น
